//本文件仅存储在未写好后端时的测试数据
const data = [{
  key: '1',
  id: '1',
  title: '开发新功能',
  initiator: '李华',
  receiver: '张伟',
  startTime: '2024-06-25 10:00',
  status: '进行中',
  description: '本任务涉及开发一个新的功能模块，该模块旨在提升公司内部管理效率。李华作为项目发起人，负责总体设计和规划，而张伟负责具体的编码和实现。项目预计需要两周时间完成，包括需求分析、设计、开发、测试和发布阶段。目标是通过新功能的引入，减少人工操作，提高系统的自动化水平，从而节省时间和人力成本。',
  image: '../../public/img/1.jpg',
}, {
  key: '2',
  id: '2',
  title: '市场调研',
  initiator: '王芳',
  receiver: 'Helen',
  startTime: '2024-06-24 09:00',
  status: '已完成',
  description: '为了更好地了解市场需求和竞争对手情况，本任务的主要目的是进行详细的市场调研。王芳作为发起人，负责总体规划和协调，而Helen将具体执行调研任务。调研内容包括消费者需求分析、市场趋势预测以及竞争对手产品分析。调研结果将用于制定公司的市场策略和产品改进计划，以确保公司的产品在市场上具有竞争力。'
}, {
  key: '3',
  id: '3',
  title: '撰写报告',
  initiator: '赵强',
  receiver: '李娜',
  startTime: '2024-06-23 14:00',
  status: '进行中',
  description: '本任务要求撰写一份详细的项目报告，内容涵盖项目背景、实施过程、结果分析和未来建议。赵强作为发起人，负责整体框架和方向，李娜则负责具体内容的撰写和整理。报告的目的是总结项目的成功经验和不足之处，为今后的项目提供参考和指导。预计报告将于一周内完成，并提交给管理层审核。'
}, {
  key: '4',
  id: '4',
  title: '产品测试',
  initiator: '孙丽',
  receiver: 'Chris',
  startTime: '2024-06-22 13:30',
  status: '已取消',
  description: '本任务旨在对新开发的产品进行全面测试，包括功能测试、性能测试和用户体验测试。孙丽作为项目发起人，负责制定测试计划和标准，Chris负责具体测试工作的执行。由于项目优先级调整，测试任务被取消，相关资源已重新分配给其他项目。未来若有需要，将重新安排测试工作。'
}, {
  key: '5',
  id: '5',
  title: '客户拜访',
  initiator: '周杰',
  receiver: 'Emily',
  startTime: '2024-06-21 11:00',
  status: '进行中',
  description: '为了加强与重要客户的联系，本任务计划对若干重要客户进行实地拜访。周杰作为发起人，负责整体安排和协调，Emily则负责具体的拜访活动。拜访的主要目的是了解客户的最新需求和反馈，并探讨未来的合作机会。通过面对面的交流，增强客户的信任和满意度，推动业务的进一步发展。'
}, {
  key: '6',
  id: '6',
  title: '设计方案',
  initiator: '冯雪',
  receiver: 'Michael',
  startTime: '2024-06-20 16:00',
  status: '已完成',
  description: '本任务旨在为公司新项目设计一个详细的解决方案。冯雪作为项目发起人，负责总体方向和审核，Michael负责具体方案的设计和编写。设计方案包括系统架构、技术选型、实施步骤和风险控制等内容。通过科学合理的设计，确保项目的顺利实施和高效运作，为公司的业务拓展提供强有力的技术支持。'
}, {
  key: '7',
  id: '7',
  title: '代码审查',
  initiator: '陈晨',
  receiver: 'Tom',
  startTime: '2024-06-19 10:30',
  status: '进行中',
  description: '为了保证代码质量，本任务要求对新开发的代码进行严格审查。陈晨作为发起人，负责制定审查标准和流程，Tom则负责具体的代码审查工作。审查内容包括代码规范、逻辑正确性、性能优化和安全性等方面。通过审查，发现和修复潜在问题，提升代码的可维护性和可靠性，确保项目的顺利进行。'
}, {
  key: '8',
  id: '8',
  title: '招聘面试',
  initiator: '李强',
  receiver: 'Anna',
  startTime: '2024-06-18 09:00',
  status: '已完成',
  description: '为满足公司业务发展的需要，本任务计划招聘若干新员工。李强作为发起人，负责制定招聘计划和面试流程，Anna负责具体的面试工作。面试内容包括专业技能测试、综合能力评估和文化契合度考察。通过严格的筛选，确保新员工的能力和素质符合公司的要求，为公司的发展注入新的活力。'
}, {
  key: '9',
  id: '9',
  title: '财务审计',
  initiator: '刘芳',
  receiver: 'James',
  startTime: '2024-06-17 15:00',
  status: '未开始',
  description: '为了确保公司财务管理的合规性和透明度，本任务计划进行全面的财务审计。刘芳作为发起人，负责审计计划的制定和总体协调，James负责具体的审计工作。审计内容包括财务报表审核、内部控制检查和风险评估。通过审计，发现和纠正潜在问题，提升公司的财务管理水平和内部控制能力。'
}, {
  key: '10',
  id: '10',
  title: '培训新员工',
  initiator: '王磊',
  receiver: 'Sarah',
  startTime: '2024-06-16 14:00',
  status: '已取消',
  description: '为了帮助新员工快速融入公司，本任务计划组织一次新员工培训。王磊作为发起人，负责培训计划的制定和讲师的安排，Sarah负责具体的培训实施。培训内容包括公司文化介绍、业务流程讲解和岗位技能培训等。由于其他紧急任务的优先处理，培训任务被取消，将在未来另行安排。'
},];

export default data;
